Revit 2025 API
DuctFittingAndAccessoryData.AirViscosity Property
 The kinematic viscosity of air for the duct fitting or duct accessory, Units: (ft^2/s).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public double AirViscosity { get; }
Public ReadOnly Property AirViscosity As Double
	Get
public:
property double AirViscosity {
	double get ();
}
member AirViscosity : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace